# Handing Missing Data

In [4]:
## 導入所需的套件
import numpy as np
import pandas as pd

In [6]:
## 構建一個包含None的數組
x = np.array([1, None, 2 ,4])
x

array([1, None, 2, 4], dtype=object)

In [7]:
## 比較object和int類型在數據操作上的速度
for dtype in ['object', 'int']:
    print("dtype = ", dtype)
    ## 1E6: 1乘10的6次方
    %timeit np.arange(1E6, dtype = dtype).sum()
    print()

dtype =  object
177 ms ± 19.8 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype =  int
7.26 ms ± 245 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [8]:
x.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [10]:
y = np.array([2, np.nan, 6, 10])
y.dtype

dtype('float64')

In [12]:
print(1 + np.nan)
print(2 + y)

nan
[ 4. nan  8. 12.]

In [17]:
print(0 * np.nan)
print(1 * y)

nan
[ 2. nan  6. 10.]

In [19]:
y.sum(), y.min(), y.max()

(nan, nan, nan)

In [22]:
np.nansum(y), np.nanmin(y), np.nanmax(y)

(18.0, 2.0, 10.0)

In [25]:
pd.Series([2, np.nan, 6, None])

0    2.0
1    NaN
2    6.0
3    NaN
dtype: float64

In [27]:
x = pd.Series(range(6), dtype = 'int64')
x

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [28]:
x[1] = None
x

0    0.0
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [29]:
data = pd.Series([2, None, 6, np.nan])
print(data)
## 檢測Null值
data.isnull()

0    2.0
1    NaN
2    6.0
3    NaN
dtype: float64

0    False
1     True
2    False
3     True
dtype: bool

In [31]:
## 找出不為null值的數據
data[data.notnull()]

0    2.0
2    6.0
dtype: float64

In [33]:
## 移除掉null值
data.dropna()

0    2.0
2    6.0
dtype: float64

In [39]:
## 構建一個含有null值的DataFrame
df = pd.DataFrame([[2, np.nan, 6],
                  [3, 5, 8],
                  [None, 6, 8]])                                  
df

     0    1  2
0  2.0  NaN  6
1  3.0  5.0  8
2  NaN  6.0  8

In [40]:
## 移除空值 - 預設情況會依據行
df.dropna()

     0    1  2
1  3.0  5.0  8

In [42]:
## 移除空值 - 依據列
df.dropna(axis = 'columns')

   2
0  6
1  8
2  8

In [44]:
## 增加一列全為NaN
df[3] = np.nan
df

     0    1  2   3
0  2.0  NaN  6 NaN
1  3.0  5.0  8 NaN
2  NaN  6.0  8 NaN

In [45]:
## 移除全部都為空值的列
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  2.0  NaN  6
1  3.0  5.0  8
2  NaN  6.0  8

In [47]:
## 移除掉非空值數量少於3的行
df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  3.0  5.0  8 NaN

In [50]:
data = pd.Series([2, None, 4, np.nan, 6], index = list("ABCDE"))

data

A    2.0
B    NaN
C    4.0
D    NaN
E    6.0
dtype: float64

In [52]:
## 用0替換空值
data.fillna(0)

A    2.0
B    0.0
C    4.0
D    0.0
E    6.0
dtype: float64

In [53]:
## 向前填充
data.fillna(method = 'ffill')

A    2.0
B    2.0
C    4.0
D    4.0
E    6.0
dtype: float64

In [56]:
## 向後填充
data.fillna(method = 'bfill')

A    2.0
B    4.0
C    4.0
D    6.0
E    6.0
dtype: float64

In [58]:
df

     0    1  2   3
0  2.0  NaN  6 NaN
1  3.0  5.0  8 NaN
2  NaN  6.0  8 NaN

In [60]:
df.fillna(method = 'ffill', axis = 1)

     0    1    2    3
0  2.0  2.0  6.0  6.0
1  3.0  5.0  8.0  8.0
2  NaN  6.0  8.0  8.0

# Hierarchical Indexing